using System;

namespace Football.Team.Builder
{
    /// <summary>
    /// Team builder class.
    /// Build team by random data.
    /// </summary>
    public class RandomTeamBuilder : TeamBuilder
    {
        /// <summary>
        /// Random generator.
        /// </summary>
        static readonly Random Random = new Random();
        //-----------------------------------------------------------------------------

        /// <summary>
        /// Builds the new team.
        /// </summary>
        /// <returns>
        /// Instance of new football team.
        /// </returns>
        public override Team Build()
        {
            var playerNames = new[]
            {
                "Абрам", "Аваз", "Аввакум", "Август", "Августин", "Авдей", "Авраам", "Автандил",
                "Агап", "Агафон", "Аггей", "Адам", "Адис", "Адольф", "Адриан", "Аким", "Алан",
                "Александр", "Алексей", "Альберт", "Альфред", "Амадей", "Амадеус", "Амаяк", "Амвросий",
                "Ананий", "Анастасий", "Анатолий", "Ангел", "Андоим", "Андрей", "Аникита", "Антон", "Арам",
                "Арий", "Аристарх", "Аркадий", "Арно", "Арнольд", "Арон", "Арсений", "Артем", "Артемий",
                "Артур", "Архип", "Аскольд", "Афанасий", "Ахмет", "Ашот", "Бальтазар", "Бежен", "Бенедикт",
                "Берек", "Бернард", "Бертран", "Богдан", "Болеслав", "Борис", "Бронислав", "Булат",
                "Вадим", "Валентин", "Валерий", "Вальтер", "Варфоломей", "Василий", "Вацлав", "Велизар",
                "Венедикт", "Вениамин", "Викентий", "Виктор", "Вилли", "Вильгельм", "Виссарион", "Виталий",
                "Витольд", "Владимир", "Владислав", "Владлен", "Володар", "Вольдемар", "Всеволод",
                "Вячеслав", "Гавриил", "Галактион", "Гарри", "Гастон", "Гаяс", "Гевор", "Геннадий",
                "Генрих", "Георгий", "Геральд", "Герасим", "Герман", "Глеб", "Гордей", "Гордон",
                "Горислав", "Градимир", "Григорий", "Гурий", "Густав", "Давид", "Дамир", "Даниил",
                "Дементий", "Демид", "Демьян", "Денис", "Джордан", "Дмитрий", "Дональд", "Донат",
                "Дорофей", "Евгений", "Евграф", "Евдоким", "Евсевий", "Евстафий", "Егор", "Елеазар",
                "Елисей", "Емельян", "Еремей", "Ермолай", "Ерофей", "Ефим", "Ефрем", "Жан", "Ждан",
                "Жорж", "Захар", "Зиновий", "Иван", "Игнатий", "Игорь", "Илларион", "Илья", "Иннокентий",
                "Иосиф", "Ипполит", "Карл", "Кирилл", "Клим", "Кондрат", "Константин", "Корней", "Кузьма",
                "Лавр", "Лаврентий", "Лев", "Леонид", "Леонтий", "Леопольд", "Лука", "Лукьян", "Макарий",
                "Максимилиан", "Марат", "Марк", "Мартин", "Матвей", "Мирослав", "Митрофан", "Михаил",
                "Михей", "Мстислав", "Муслим", "Назар", "Назарий", "Натан", "Наум", "Нестор", "Никанор",
                "Никита", "Никифор", "Николай", "Никон", "Нифонт", "Норман", "Овидий", "Олан", "Олег",
                "Олесь", "Онисим", "Орест", "Осип", "Оскар", "Павел", "Петр", "Платон", "Прохор", "Рашид",
                "Ринат", "Ричард", "Роберт", "Родион", "Ролан", "Роман", "Ростислав", "Рудольф", "Савва",
                "Самсон", "Семён", "Серафим", "Сергей", "Степан", "Тарас", "Тигран", "Тимофей", "Тимур",
                "Тихон", "Трофим", "Устин", "Фаддей", "Федор", "Федот", "Феликс", "Феодосий", "Фердинанд",
                "Фидель", "Филимон", "Филипп", "Флор", "Флорентий", "Фома", "Франц", "Фридрих", "Фуад",
                "Харитон", "Христиан", "Христос", "Христофор", "Эдгар", "Эдуард", "Эльдар", "Эмиль",
                "Эммануил", "Эрик", "Эрнест", "Юлиан", "Юлий", "Юрий", "Юхим", "Яким", "Яков", "Ян",
                "Януарий", "Яромир", "Ярослав", "Ясон"
            };

            var playerSurnames = new[]
            {
                "Иванов", "Петров", "Сидоров", "Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов",
                "Лебедев", "Козлов", "Новиков", "Морозов", "Петров", "Волков", "Соловьёв", "Васильев",
                "Зайцев", "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов", "Воробьёв", "Фёдоров",
                "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров",
                "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов",
                "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров",
                "Борисов", "Королёв", "Герасимов", "Пономарёв", "Григорьев", "Лазарев", "Медведев", "Ершов",
                "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв",
                "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев",
                "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов",
                "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов",
                "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Денисов", "Громов",
                "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников", "Карпов", "Афанасьев",
                "Власов", "Маслов", "Исаков", "Тихонов", "Аксёнов", "Гаврилов", "Родионов", "Котов", "Горбунов",
                "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов", "Абрамов",
                "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов",
                "Овчинников", "Селезнёв", "Панфилов", "Копылов", "Михеев", "Галкин", "Назаров", "Лобанов",
                "Лукин", "Беляков", "Потапов", "Некрасов", "Хохлов", "Жданов", "Наумов", "Шилов", "Воронцов",
                "Ермаков", "Дроздов", "Игнатьев", "Савин", "Логинов", "Сафонов", "Капустин", "Кириллов",
                "Моисеев", "Елисеев", "Кошелев", "Костин", "Горбачёв", "Орехов", "Ефремов", "Исаев", "Евдокимов",
                "Калашников", "Кабанов", "Носков", "Юдин", "Кулагин", "Лапин", "Прохоров", "Нестеров", "Харитонов",
                "Агафонов", "Муравьёв", "Ларионов", "Федосеев", "Зимин", "Пахомов", "Шубин", "Игнатов",
                "Филатов", "Крюков", "Рогов", "Кулаков", "Терентьев", "Молчанов", "Владимиров", "Артемьев",
                "Гурьев", "Зиновьев", "Гришин", "Кононов", "Дементьев", "Ситников", "Симонов", "Мишин",
                "Фадеев", "Комиссаров", "Мамонтов", "Носов", "Гуляев", "Шаров", "Устинов", "Вишняков",
                "Евсеев", "Лаврентьев", "Брагин", "Константинов", "Корнилов", "Авдеев", "Зыков", "Бирюков",
                "Шарапов", "Никонов", "Щукин", "Дьячков", "Одинцов", "Сазонов", "Якушев", "Красильников",
                "Гордеев", "Самойлов", "Князев", "Беспалов", "Уваров", "Шашков", "Бобылёв", "Доронин",
                "Белозёров", "Рожков", "Самсонов", "Мясников", "Лихачёв", "Буров", "Сысоев", "Фомичёв",
                "Русаков", "Стрелков", "Гущин", "Тетерин", "Колобов", "Субботин", "Фокин", "Блохин",
                "Селиверстов", "Пестов", "Кондратьев", "Силин", "Меркушев", "Лыткин", "Туров"
            };

            var teamNames = new[]
            {
                "Авангард", "Академия", "Алания", "Алания-Д", "Амкар", "Амур-2010", "Ангушт", "Анжи",
                "Астрахань", "Балтика", "Биолог-Новокубанск", "Витязь", "Волга", "Волгарь-Газпром",
                "Волочанин-Ратмир", "Газовик", "Горняк", "Губкин", "Дагдизель", "Динамо", "Днепр",
                "Дружба", "Енисей", "Звезда", "Зенит", "Знамя", "Иртыш", "Истра", "Калуга", "КАМАЗ",
                "Карелия", "Краснодар", "Крылья", "Кубань", "Кузбасс", "Локомотив", "Локомотив-2",
                "Луч-Энергия", "Машук-КМВ", "Металлург", "Металлург-Кузбасс", "Металлург-Оскол", "МИТОС",
                "Мордовия", "Мостовик-Приморье", "Нефтехимик", "Нижний", "Носта", "Октан", "Олимпия",
                "Петротрест", "Подолье", "Псков-747", "Радиан-Байкал", "Ростов", "Ротор", "Рубин", "Рубин-2",
                "Русичи", "Салют", "Сатурн-2", "Сахалин", "Север", "Сибирь", "Сибирь-2", "Сибиряк", "СКА",
                "СКА-Энергия", "Славянский", "Смена", "Сокол", "Спартак-Нальчик", "Спартак", "Сызрань-2003",
                "Таганрог", "Текстильщик", "Терек", "Томь", "Торпедо", "Тюмень", "Урал", "Уфа", "Факел", "ФАЮР",
                "Химик", "Химки", "ЦСКА", "Челябинск", "Черноморец", "Чита", "Шексна", "Шинник", "Энергия", "Якутия"
            };

            // Build list of players.
            var playersCount = Random.Next(10, 30);
            var players = new Player[playersCount];
            for (var i = 0; i < playersCount; i++)
            {
                var playerName = playerNames[Random.Next(0, playerNames.Length - 1)];
                var playerSurname = playerSurnames[Random.Next(0, playerSurnames.Length - 1)];
                var playerFullName = string.Format("{0} {1}", playerSurname, playerName);
                var playerNumber = Random.Next(0, 100);

                var playerSkills = new PlayerSkills
                {
                    Power = Random.Next(PlayerSkills.MinSkillValue, PlayerSkills.MaxSkillValue),
                    Endurance = Random.Next(PlayerSkills.MinSkillValue, PlayerSkills.MaxSkillValue),
                    Speed = Random.Next(PlayerSkills.MinSkillValue, PlayerSkills.MaxSkillValue)
                };

                players[i] = new Player(playerNumber, playerFullName, playerSkills);
            }

            var teamName = teamNames[Random.Next(0, teamNames.Length - 1)];
            return new Team(teamName, players);

        } // End
        //-----------------------------------------------------------------------------

    } // End class
    //-----------------------------------------------------------------------------

} // End namespace
//-----------------------------------------------------------------------------